mdmfile/src/BusinessProcesses/мдмПроцессОбработки/мдмПроцессОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>мдмПроцессОбработки</name>
  <task>Task.мдмЗадачаОбработки</task>
  <attributes>
    <name>БизнесПроцесс</name>
    <type>
      <types>CatalogRef.мдмБизнесПроцессы</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Прерван</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗадания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>DefinedType.мдмМастерДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>Данные</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:BusinessProcess>

mdmfile/src/Catalogs/мдмТочкиБизнесПроцесса/мдмТочкиБизнесПроцесса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмТочкиБизнесПроцесса</name>
  <owners>Catalog.мдмБизнесПроцессы</owners>
  <attributes>
    <name>Точка</name>
    <type>
      <types>DefinedType.мдмТочкаБизнесПроцесса</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

mdmfile/src/Catalogs/мдмТочкиСтарт/мдмТочкиСтарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмТочкиСтарт</name>
  <owners>Catalog.мдмБизнесПроцессы</owners>
  <attributes>
    <name>ПередСтартом</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Выходы</name>
    <attributes>
      <name>Точка</name>
      <type>
        <types>DefinedType.мдмТочкаБизнесПроцесса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

mdmfile/src/Catalogs/мдмТочкиЗавершение/мдмТочкиЗавершение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмТочкиЗавершение</name>
  <owners>Catalog.мдмБизнесПроцессы</owners>
  <attributes>
    <name>ПриЗавершении</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Входы</name>
    <attributes>
      <name>Точка</name>
      <type>
        <types>DefinedType.мдмТочкаБизнесПроцесса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

mdmfile/src/BusinessProcesses/мдмПроцессОбработки/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ТекущиеТочкиБизнесПроцесса(БизнесПроцесс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаОбработки.Ссылка КАК Ссылка,
		|	ЗадачаОбработки.Исполнитель КАК Исполнитель,
		|	ЗадачаОбработки.ТочкаБизнесПроцесса.Имя КАК ИмяТочки
		|ИЗ
		|	Задача.мдмЗадачаОбработки КАК ЗадачаОбработки
		|ГДЕ
		|	ЗадачаОбработки.БизнесПроцесс = &БизнесПроцесс
		|	И ЗадачаОбработки.Выполнена = ЛОЖЬ
		|	И ЗадачаОбработки.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);
	
	Результат = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(
			Новый Структура("Ссылка, Исполнитель, ИмяТочки",
				Выборка.Ссылка, 
				Выборка.Исполнитель,
				Выборка.ИмяТочки
			)
		);
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

Функция ВыполненныеТочкиБизнесПроцесса(БизнесПроцесс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|   ЗадачаОбработки.Ссылка КАК Ссылка,
		|   ЗадачаОбработки.Исполнитель КАК Исполнитель,
		|	ЗадачаОбработки.ТочкаБизнесПроцесса.Имя КАК ИмяТочки
		|ИЗ
		|	Задача.мдмЗадачаОбработки КАК ЗадачаОбработки
		|ГДЕ
		|	ЗадачаОбработки.БизнесПроцесс = &БизнесПроцесс
		|	И ЗадачаОбработки.Выполнена = ИСТИНА
		|	И ЗадачаОбработки.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);
	
	Результат = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(
			Новый Структура("Ссылка, Исполнитель, ИмяТочки",
				Выборка.Ссылка, 
				Выборка.Исполнитель,
				Выборка.ИмяТочки
			)
		);
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

Функция ТочкаСтарт(БизнесПроцесс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТочкиБизнесПроцесса.Точка КАК Точка
		|ИЗ
		|	Справочник.мдмТочкиБизнесПроцесса КАК ТочкиБизнесПроцесса
		|ГДЕ
		|	ТочкиБизнесПроцесса.Владелец = &БизнесПроцесс
		|	И ТочкиБизнесПроцесса.Точка ССЫЛКА Справочник.мдмТочкиСтарт";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() тогда
		Возврат Справочники.мдмТочкиСтарт.ПустаяСсылка();
	Иначе 
		Выборка = РезультатЗапроса.Выбрать();		
		Выборка.Следующий();
		Возврат Выборка.Точка;
	КонецЕсли;	
	
КонецФункции	

Функция ТочкаЗавершение(БизнесПроцесс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТочкиБизнесПроцесса.Точка КАК Точка
		|ИЗ
		|	Справочник.мдмТочкиБизнесПроцесса КАК ТочкиБизнесПроцесса
		|ГДЕ
		|	ТочкиБизнесПроцесса.Владелец = &БизнесПроцесс
		|	И ТочкиБизнесПроцесса.Точка ССЫЛКА Справочник.мдмТочкиЗавершение";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() тогда
		Возврат Справочники.мдмТочкиЗавершение.ПустаяСсылка();
	Иначе 
		Выборка = РезультатЗапроса.Выбрать();		
		Выборка.Следующий();
		Возврат Выборка.Точка;
	КонецЕсли;	
	
КонецФункции	

#КонецОбласти
